Revit 2026 API

# FamilyExtractPartAtom Method

---

Writes a PartAtom XML from the contents of a family object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ExtractPartAtom(
	string xmlFilePath
)
```
```vb
Public Sub ExtractPartAtom (
	xmlFilePath As String
)
```
```cpp
public:
void ExtractPartAtom(
	String^ xmlFilePath
)
```
```fsharp
member ExtractPartAtom :
        xmlFilePath : string -> unit
```

#### Parameters

xmlFilePath String
    The xml file to be saved.

| Exception | Condition |
| --- | --- |
| ArgumentException | If 'xmlFilePath' is  or an empty string. |

This method is designed for a family loaded into a document in session. So it will skip the type catalog file. To extract the PartAtom XML from a family file on disk, use Application.ExtractPartAtomFromFamilyFile()

#### Reference

Family Class

Autodesk.Revit.DB Namespace